   ///\+359([ -])2\1\d{3}\1\d{4}\b
    //([ -]) кръглите скоби го отделя в група после с \1 правим референция към групата така принтира номерата които са
    //отделени САМО с интервали или САМО с спейс като +359-2-222-2222 или +359 2 222 2222
    // а НЕ хваща номера които имат и двете като +359-2 222 2222

    // d{3} - цифри, точно 3 цифри

function matchPhoneNumber(input){

    let pattern = /\+359([ -])2\1\d{3}\1\d{4}\b/g;
    let text = input.shift();

    let result = text.match(pattern)
    console.log(result.join(', '));


}
matchPhoneNumber(['+359 2 222 2222,359-2-222-2222, +359/2/222/2222, +359-2 222 2222 +359 2-222-2222, +359-2-222-222, +359-2-222-22222 +359-2-222-2222'])


